app/views/devise/sessions/new.html.erb

SELECT  "images".* FROM "images"  WHERE "images"."id" = ? LIMIT 1  [["id", 1]]
---
<% @imageBackground = root_url + "images/" + Image.find(rand(1..3)).name %>