app/controllers/homes_controller.rb

  def index
    @homes = Home.all
---
SELECT "homes".* FROM "homes"