app/controllers/images_controller.rb

SELECT  "images".* FROM "images"  WHERE "images"."id" = ? LIMIT 1  [["id", 0]]
---
    def set_image
      @image = Image.find(params[:id])