app/controllers/testrs_controller.rb

  def index
    @testrs = Testr.all
---
SELECT "testrs".* FROM "testrs"